app/Controllers/Export.php

SELECT *
FROM `stock`
---
    public function stock()
    {
        $model = new M_stock();
        $data['judul'] = "Stock Barang (Inventory)";
        $data['rows']  = $model->findAll();

SELECT *
FROM `stock`
---
    public function stock_pdf()
    {
        $mpdf = new Mpdf();

        $model = new M_stock();
        $data['rows']  = $model->findAll();