app/Controllers/Home.php

SELECT SUM(`qty`) AS `qty`
FROM `masuk`
 LIMIT 1
SELECT SUM(`qty`) AS `qty`
FROM `keluar`
 LIMIT 1
SELECT SUM(`stock`) AS `stock`
FROM `stock`
 LIMIT 1
---
    public function index()
    {
        $masukModel  = new M_masuk();
        $keluarModel = new M_keluar();
        $stockModel  = new M_stock();

        $tahun = $this->request->getGet('tahun') ?? date('Y');
        $totalMasuk = $masukModel->selectSum('qty')->first()['qty'];
        $totalKeluar = $keluarModel->selectSum('qty')->first()['qty'];
        $totalStockAkhir = $stockModel->selectSum('stock')->first()['stock'];