app/Controllers/Keluar.php

SELECT *
FROM `stock`
---
    public function index()
    {
        $keluarModel = new M_keluar();
        $stockModel  = new M_stock();

        // GET parameters
        $bulan      = $this->request->getGet('bulan');
        $sortBy     = $this->request->getGet('sortBy');
        $sortOrder  = $this->request->getGet('sortOrder') ?? 'ASC';
        $limit      = (int)($this->request->getGet('limit') ?? 10);
        $page       = (int)($this->request->getGet('page') ?? 1);
        $offset     = ($page - 1) * $limit;

        // Data keluar setelah filtering + sorting
        $keluar = $keluarModel->getFiltered($bulan, $sortBy, $sortOrder, $limit, $offset);

        $totalData = $keluarModel->countFiltered($bulan);

        $data = [
            'judul'     => 'Barang Keluar',
            'stockList' => $stockModel->findAll(),