app/Controllers/Stock.php

SELECT *
FROM `stock`
---
    public function index()
    {
        $model = new M_stock();

        $data = [
            'judul' => 'Stock Barang',
            'stock' => $model->findAll()