app/Models/M_keluar.php

    public function getFiltered($bulan = null, $sortBy = null, $sortOrder = 'ASC', $limit = 10, $offset = 0)
    {
        $builder = $this->table($this->table)
            ->select('keluar.*, stock.namabarang')
            ->join('stock', 'stock.idbarang = keluar.idbarang');

        // Filter bulan
        if ($bulan) {
            $builder->where('MONTH(tanggal)', $bulan);
        }

        // Sorting
        if ($sortBy === 'tanggal') {
            $builder->orderBy('tanggal', $sortOrder);
        } elseif ($sortBy === 'nama') {
            $builder->orderBy('stock.namabarang', $sortOrder);
        } elseif ($sortBy === 'qty') {
            $builder->orderBy('qty', $sortOrder);
        }

        return $builder->limit($limit, $offset)->get()->getResultArray();
---
SELECT `keluar`.*, `stock`.`namabarang`
FROM `keluar`
JOIN `stock` ON `stock`.`idbarang` = `keluar`.`idbarang`
ORDER BY `stock`.`namabarang` DESC
 LIMIT 10

    public function countFiltered($bulan = null)
    {
        $builder = $this->table($this->table);

        if ($bulan) {
            $builder->where('MONTH(tanggal)', $bulan);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `keluar`

    public function getTahunList()
    {
        return $this->select("YEAR(tanggal) as tahun")
            ->groupBy("YEAR(tanggal)")
            ->orderBy("tahun", "DESC")
            ->findAll();
---
SELECT YEAR(tanggal) as tahun
FROM `keluar`
GROUP BY YEAR(tanggal)
ORDER BY `tahun` DESC

    public function getQtyByMonth()
    {
        $result = $this->select("MONTH(tanggal) AS bulan, SUM(qty) AS jumlah")
            ->groupBy("MONTH(tanggal)")
            ->orderBy("MONTH(tanggal)", "ASC")
            ->findAll();
---
SELECT MONTH(tanggal) AS bulan, SUM(qty) AS jumlah
FROM `keluar`
GROUP BY MONTH(tanggal)
ORDER BY MONTH(tanggal) ASC