app/Models/M_masuk.php

    public function getAllData()
    {
        return $this->db->table('masuk')
            ->join('stock', 'stock.idbarang = masuk.idbarang')
            ->orderBy('masuk.tanggal', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `masuk`
JOIN `stock` ON `stock`.`idbarang` = `masuk`.`idbarang`
ORDER BY `masuk`.`tanggal` DESC

    public function getFilteredData($bulan = null, $sortBy = null, $sortOrder = 'ASC', $limit = 10, $offset = 0)
    {
        $builder = $this->table($this->table)
            ->select('masuk.*, stock.namabarang')
            ->join('stock', 'stock.idbarang = masuk.idbarang');

        // Filter bulan
        if ($bulan) {
            $builder->where('MONTH(masuk.tanggal)', $bulan);
        }

        // Sorting
        if ($sortBy == 'nama') {
            $builder->orderBy('stock.namabarang', $sortOrder);
        } elseif ($sortBy == 'qty') {
            $builder->orderBy('masuk.qty', $sortOrder);
        } elseif ($sortBy == 'tanggal') {
            $builder->orderBy('masuk.tanggal', $sortOrder);
        }

        return $builder->limit($limit, $offset)->get()->getResultArray();
---
SELECT `masuk`.*, `stock`.`namabarang`
FROM `masuk`
JOIN `stock` ON `stock`.`idbarang` = `masuk`.`idbarang`
ORDER BY `stock`.`namabarang` DESC
 LIMIT 10

    public function countFilteredData($bulan = null)
    {
        $builder = $this->table($this->table);

        if ($bulan) {
            $builder->where('MONTH(tanggal)', $bulan);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `masuk`

    public function getTahunList()
    {
        return $this->select("YEAR(tanggal) as tahun")
            ->groupBy("YEAR(tanggal)")
            ->orderBy("tahun", "DESC")
            ->findAll();
---
SELECT YEAR(tanggal) as tahun
FROM `masuk`
GROUP BY YEAR(tanggal)
ORDER BY `tahun` DESC

    public function getQtyByMonth()
    {
        $result = $this->select("MONTH(tanggal) AS bulan, SUM(qty) AS jumlah")
            ->groupBy("MONTH(tanggal)")
            ->orderBy("MONTH(tanggal)", "ASC")
            ->findAll();
---
SELECT MONTH(tanggal) AS bulan, SUM(qty) AS jumlah
FROM `masuk`
GROUP BY MONTH(tanggal)
ORDER BY MONTH(tanggal) ASC