app/Models/M_stock.php

SELECT *
FROM `stock`
---
    public function getAllData()
    {
        return $this->findAll();

SELECT *
FROM `stock`
ORDER BY `namabarang` DESC
 LIMIT 5
---
    public function getFilteredData($sortBy = null, $sortOrder = 'ASC', $limit = 10, $offset = 0)
    {
        $builder = $this->table($this->table);

        // Sort
        if ($sortBy == 'nama') {
            $builder->orderBy('namabarang', $sortOrder);
        }

        if ($sortBy == 'stock') {
            $builder->orderBy('stock', $sortOrder);
        }

        // Pagination
        return $builder->limit($limit, $offset)->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `stock`
---
    public function countAllData()
    {
        return $this->countAll();